[{"title":"Exclusive: Women In Tech Challenge Event Organizers To Make ...","url":"http://feedproxy.google.com/~r/fastcompany/headlines/~3/H_NLNzOWmtI/exclusive-women-in-tech-challenge-event-organizers-to-make-the-50-50-pl","desc":"If you say you can't find women to speak at your tech event, this list of 1000+ \nindustry leaders will prove you wrong."},{"title":"Women in Technology: Guadalajara, México | Intel® Developer Zone","url":"http://feedproxy.google.com/~r/IntelSoftwareNetworkBlog/~3/F7esz_8ykuw/women-in-technology-guadalajara-m-xico","desc":"An article briefly covering the Women in Technology event organized and \nexecuted by Intel(R) Guadalajara: the first developer event dedicated to women \nin ..."},{"title":"With STEM Education, Women Can Create Both Technology and ...","url":"http://feedproxy.google.com/~r/IntelBlogs/~3/IY7KAQcF_WI/with-stem-education-women-can-create-both-technology-and-their-own-futures","desc":"The decline of young women's participation in science, technology, engineering \nand math (STEM) education in the U.S. is alarming for many reasons, but it's ..."},{"title":"The Women in Tech Summit is coming to Baltimore - Technical.ly ...","url":"http://feedproxy.google.com/~r/startupbaltimore/~3/-pH5uDC0dRA/","desc":"For four years, a conference focused on bringing women in technology together \nhas been growing in Philadelphia. This fall, the Women in Tech Summit will ..."},{"title":"How Women Can Disrupt The Tech Industry - KISSmetrics","url":"http://feedproxy.google.com/~r/KISSmetrics/~3/0BTvuiXgHvk/","desc":"If Ellen Pao's name rings a bell, it's because she recently lost a gender \ndiscrimination suit against Kleiner Perkins that had put the issue of women in \ntech in the ..."},{"title":"\"The Computer Girls,\" 1967 Cosmopolitan magazine article on ...","url":"http://feedproxy.google.com/~r/boingboing/iBag/~3/48WBWR6RpwU/the-computer-girls-1967-c.html","desc":"\"The Computer Girls,\" 1967 Cosmopolitan magazine article on women working \nwith technology. By Xeni Jardin at 9:27 am Fri, Jul 31, 2015 ..."},{"title":"When Woman Is Boss: Nikola Tesla on Gender Equality and How ...","url":"http://feedproxy.google.com/~r/brainpickings/rss/~3/G_-v8hsrhn4/","desc":"\"The average woman will be as well educated as the average man, and then ... \ntags: books culture futurism history Nikola Tesla science technology women."},{"title":"Getting Tech Women On Board (Boards of Directors, That Is) - IEEE ...","url":"http://feedproxy.google.com/~r/IeeeSpectrum/~3/qyoHUfTDLHM/getting-tech-women-on-board-boards-of-directors-that-is","desc":"The data has been in for years—companies with women board members are \nmore successful by all sorts of objective measures. But Silicon Valley's tech ..."}]